Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/rights_of_residence_in_ireland/residence_rules_UK_citizens.html.txt.tmx
Source language: en
Languages: ga

source: Residence rights of UK citizens
ga: Cearta cónaitheachta shaoránaigh na RA

source: People who are citizens of the United Kingdom (UK) are entitled to live in Ireland without any conditions or restrictions
ga: Tá saoránaigh na Ríochta Aontaithe (an RA) i dteideal cónaí in Éirinn gan aon choinníollacha nó srianta

source: Unlike the citizens of other countries, they are not subject to the Aliens Act 1935 or to any orders made under it
ga: Murab ionann agus saoránaigh thíortha eile, níl siad faoi réir Acht na nEachtrannach, 1935 nó aon orduithe a dhéantar faoi

source: This means that a UK citizen does not need a visa, any form of residence permit or employment permit in Ireland
ga: Ciallaíonn seo nach dteastaíonn víosa, aon fhoirm de chead cónaitheachta nó cead fostaíochta ó shaoránach na RA in Éirinn

source: They are entitled to move to Ireland from any country and they may move to Ireland to work or to retire
ga: Tá siad i dteideal bogadh go hÉirinn ó thír ar bith agus féadfaidh siad bogadh go hÉirinn chun oibriú nó chun dul ar scor

source: Unlike other EU citizens, UK citizens may retire to Ireland without having to establish that they have sufficient resources or that they have private health insurance
ga: Murab ionann agus saoránaigh eile an AE, féadfaidh saoránaigh na RA dul ar scor in Éirinn gan bheith orthu a dheimhniú go bhfuil acmhainní leordhóthanacha acu nó go bhfuil árachas sláinte príobháideach acu

source: In general, while living in Ireland, UK citizens are entitled to avail of public services on the same basis as Irish citizens living in Ireland
ga: Go ginearálta, fad atá tú i do chónaí in Éirinn, tá saoránaigh na RA i dteideal seirbhísí poiblí a fháil ar an mbonn céanna le saoránaigh Éireannacha a chónaíonn in Éirinn

source: They are entitled to vote in Irish elections with the exception of Presidential elections and referendums
ga: Tá siad i dteideal vóta a chaitheamh i dtoghcháin na hÉireann, seachas i gcás toghcháin Uachtaránachta agus reifreann

source: The right of UK citizens to live in Ireland derives from Irish law
ga: Bronnann dlí na hÉireann an ceart ar shaoránaigh na RA chun cónaí in Éirinn

source: UK citizens also have rights under the EU freedom of movement legislation
ga: Anuas air sin, tá cearta ag saoránaigh na RA faoi reachtaíocht um shaoirse gluaiseachta an AE

source: These rules do not expand the rights of UK citizens themselves (since their rights are more extensive than those of other EU citizens) but they may be relevant for the family members of UK citizens living in Ireland
ga: Ní chuireann na rialacha seo le cearta shaoránaigh na RA, iad féin (mar gheall go bhfuil a gcearta níos fairsinge ná cearta saoránach eile) ach d’fhéadfaidís bheith bainteach le daoine muinteartha shaoránaigh na RA a chónaíonn in Éirinn

source: Family members of UK citizens who are not themselves EU citizens may be able to move to Ireland to live with them
ga: B’fhéidir go mbeidh daoine muinteartha shaoránaigh na RA nach saoránaigh an AE iad féin, in ann bogadh go hÉirinn, chomh maith, chun cónaí leo

source: UK citizens do not need a passport when travelling to Ireland from within the Common Travel Area
ga: Ní theastaíonn pas ó shaoránaigh na RA nuair a thaistealaíonn siad go hÉirinn ó áiteanna laistigh den Chomhlimistéar Taistil

source: However they can be asked for photo identification and proof that they are a UK citizen
ga: Is féidir iarraidh orthu, áfach, chun aitheantas grianghraif agus cruthúnas a sholáthar gur saoránach na RA iad

source: They do need a passport if travelling from outside the Common Travel Area
ga: Teastaíonn pas uathu má bhíonn siad ag taisteal ó áit lasmuigh den Chomhlimistéar Taistil

source: The UK government has a short guide for UK citizens living in Ireland and travelling to Ireland
ga: D’fhoilsigh rialtas na RA treoir ghearr do shaoránaigh na RA atá ag cónaí in Éirinn agus ag taisteal go hÉirinn

source: UK citizens are entitled to live in Ireland
ga: Tá saoránaigh na RA i dteideal cónaí in Éirinn

source: In general, people who are not Irish citizens are subject to the Aliens Act 1935 as amended
ga: Go ginearálta, bíonn daoine nach saoránaigh Éireannacha iad faoi réir Acht na nEachtrannach, 1935, arna leasú

source: UK citizens are not
ga: Níl saoránaigh na RA

source: While resident in Ireland, they are subject to the criminal and civil law in the same way as all other residents
ga: Fad a bhíonn siad ina gcónaí in Éirinn, bíonn siad faoi réir an dlí choiriúil agus shibhialta ar an mbealach céanna a bhíonn gach cónaitheoir eile

source: Among other things, this means that they may be arrested for crimes allegedly committed in other countries and may be extradited
ga: I measc rudaí eile, ciallaíonn seo gur féidir iad a ghabháil mar gheall ar choireanna a rinne siad i dtíortha eile agus féadtar iad a eiseachadadh

source: Entitlement to health services
ga: Teidlíocht do sheirbhísí sláinte

source: UK citizens who are resident in Ireland are entitled to health services in the same way as Irish citizens who are resident
ga: Tá saoránaigh na RA a chónaíonn in Éirinn i dteideal seirbhísí sláinte a fháil ar an mbealach céanna le saoránaigh Éireannacha a chónaíonn anseo

source: This means that they may avail of public health services if they are “ordinarily resident”
ga: Ciallaíonn seo gur féidir leo seirbhísí sláinte poiblí a fháil má tá “gnáthchónaí orthu” anseo

source: UK citizens resident in Ireland whose income is from a UK source and who do not have any income from Ireland may be entitled to a medical card regardless of their means
ga: D’fhéadfadh saoránaigh na RA a chónaíonn in Éirinn arb ó fhoinse san RA a n-ioncam agus nach bhfuil aon ioncam acu ó Éirinn bheith i dteideal cárta leighis a fháil gan aird ar a maoin

source: Entitlement to social welfare payments
ga: Teidlíocht d’íocaíochtaí leasa shóisialaigh

source: UK citizens living in Ireland are eligible for social welfare payments in the same way as Irish citizens living in Ireland
ga: Tá saoránaigh na RA a chónaíonn in Éirinn i dtaobh íocaíochtaí leasa shóisialta ar an mbealach céanna le saoránaigh Éireannacha a chónaíonn in Éirinn

source: Residence in the Common Travel Area is treated the same way as residence in Ireland for the purposes of the habitual residence condition (HRC)
ga: Caitear le cónaitheacht sa Chomhlimistéar Taistil ar an mbealach céanna le cónaitheacht in Éirinn ar mhaithe le cuspóirí choinníoll an ghnáthchónaithe (HRC)

source: UK citizens coming from the Common Travel area have a right to reside in Ireland
ga: Tá an ceart ag saoránaigh na RA ón gComhlimistéar Taistil chun cónaí in Éirinn

source: However, they still need to meet the requirements of the HRC (in the same way as Irish citizens living in Ireland) to qualify for many means-tested social welfare payments
ga: Mar sin féin, is gá dóibh riachtanais choinníoll an ghnáthchónaithe a chomhlíonadh, áfach, (ar an mbealach céanna le saoránaigh Éireannacha a chónaíonn in Éirinn) chun cáiliú do go leor íocaíochtaí leasa shóisialaigh a ndéantar tástáil mhaoine orthu

source: UK citizens who have recently moved to Ireland may find it more difficult to establish that their main centre of interest is in Ireland
ga: B’fhéidir go mbeidh deacrachtaí ag saoránaigh na RA a bhog go hÉirinn le déanaí a dheimhniú gurb in Éirinn atá a bpríomhphointe suime

source: UK citizens living in Ireland are entitled to vote in national, local and European Parliament elections if they meet the other requirements
ga: Tá saoránaigh na RA a chónaíonn in Éirinn i dteideal vóta a chaitheamh sna toghcháin náisiúnta, áitiúla agus i dtoghcháin Pharlaimint na hEorpa má chomhlíonann siad na riachtanais eile

source: They are not entitled to vote in Presidential elections or referendums
ga: Níl siad i dteideal vóta a chaitheamh i dtoghcháin Uachtaránachta nó i reifreann
